Repository: ems-project/elasticms
Catalog: EMS/form-bundle/src/Resources/translations/validators.*.xlf
Languages: de, nl

# niss_insz
source: The social security number "{{string}}" is invalid.
de: Die Nationalregisternummer "{{string}}" ist ungültig.
nl: Het rijksregisternummer "{{string}}" is ongeldig.

# belgium_phone
source: The phone number "{{string}}" is invalid.
de: Die Telefonnummer "{{string}}" ist ungültig.
nl: Het telefoonnummer "{{string}}" is ongeldig.

# confirm_email
source: The "{{field1}}" and "Confirm {{field2}}" fields must match.
de: Die Felder "{{field1}}" und "{{field2}} bestätigen" müssen übereinstimmen.
nl: De velden "{{field1}}" en "Bevestig {{field2}}" moeten dezelfde waarde hebben.

# confirm_label
source: Confirm %field%
de: %label% bestätigen
nl: Bevestig %field%

# date_label
source: %label_date% (dd/mm/yyyy)
de: %label_date% (dd/mm/jjjj)
nl: %label_date% (dd/mm/jjjj)

# time_label
source: %label_time% (hh:mm)
de: %label_time% (uu:mm)
nl: %label_time% (uu:mm)

# confirm_code_invalid
source: The confirmation code "{{code}}" is not valid.
de: Der Bestätigungscode "{{code}}" ist ungültig.
nl: Bevestigingscode "{{code}}" is niet geldig.

# confirm_code_missing
source: You have not requested a confirmation code.
de: Sie haben keinen Bestätigungscode beantragt.
nl: U hebt geen bevestigingscode gevraagd.

# birth_date
source: The date must be in the past.
de: Das Datum muss in der Vergangenheit liegen.
nl: De datum moet in het verleden liggen.

# birth_date_age
source: The date must be earlier than "{{age}}".
de: Das Datum muss vor dem "{{age}}" liegen.
nl: De datum moet vroeger zijn dan {{age}}.
